---
kind: method
id: M:Autodesk.Revit.DB.ParameterMap.#ctor
source: html/8f26cf44-3582-1890-1651-ab170eaa4f9a.htm
---
# Autodesk.Revit.DB.ParameterMap.#ctor Method

Initializes a new instance of the ParameterMap class

## Syntax (C#)
```csharp
public ParameterMap()
```